//======================================================================
//
// Time-stamp: <2007-12-20 14:01:46  Shisheng.Zhi, 0354>
//
// 每个功能码的相关属性
//
//======================================================================


//-------------------------------------------------
// 这段说明有错误
//
// 之后增加功能码，需要的EEPROM地址请使用：
// 1、每组功能码中的预留空间。
// 2、238-260，共23个
// 3、950-1007，

// EEPROM地址的分配：
// 0    - 15，  共16个，保留不使用
// 16   - 1031，共1016个，使用。
// 1032 - 2047，共1026个，备份。

// 238-260，共23个，预留。
// 830-889，共60个，这块EEPROM区间给 故障记录 使用
// 890-949，共60个，这块EEPROM区间给 掉电记忆 使用
//-------------------------------------------------

#include "f_funcCode.h"
#include "f_io.h"
#include "f_main.h"
#include "f_runSrc.h"
#include "f_frqSrc.h"


#if F_DEBUG_RAM
#pragma DATA_SECTION(funcCode, "data_ram");
#endif
FUNCCODE_ALL funcCode;

#if DEBUG_MD290_SEARIS
#define F2NUM_C 1
#define A0NUM_C 1
#elif 1
#define F2NUM_C 52
#define A0NUM_C 10
#endif

#if DEBUG_F_POSITION_CTRL
#pragma DATA_SECTION(funcCodeGradeCurMenuMode, "data_ram");
#endif
// 当前菜单模式下，对每一group，用户可以操作的grade个数。
// 为0，表示不可访问该组功能码。
Uint16 funcCodeGradeCurMenuMode[FUNCCODE_GROUP_NUM];
const Uint16 funcCodeGradeAll[FUNCCODE_GROUP_NUM] =
{//显示个数隐藏
 //===========================
     F0NUM - 0,  F1NUM - 0,  F2NUM - 0,  F3NUM - 4,  // F0-F3
     F4NUM - 0,  F5NUM - 0,  F6NUM - 5,  F7NUM - 0,  // F4-F7
     F8NUM - 0,  F9NUM - 8,  FANUM - 0,  FBNUM - 0,  // F8-FB
     FCNUM - 0,  FDNUM - 1,  FENUM - 0,  FFNUM - 0,  // FC-FF

 //===========================
     FPNUM - 1,                                      // FP

 //===========================
     A0NUM_C - 1,  A1NUM - 0,  A2NUM - 0,  A3NUM - 1,  // A0-A3
     A4NUM - 1,  A5NUM - 0,  A6NUM - 0,  A7NUM - 2,  // A4-A7
     A8NUM - 0,  A9NUM - 1, AANUM - 1,  ABNUM - 1,  // A8-AB
     ACNUM - 8, ADNUM - 1,  0,          AFNUM - 1,  // AC-AF

 //===========================
     B0NUM - 1,  B1NUM - 1,  B2NUM - 1,  B3NUM - 1,  // B0-B3
     B4NUM - 1,  B5NUM - 1,  B6NUM - 1,  B7NUM - 1,  // B4-B7
     B8NUM - 1,  B9NUM - 1,  BANUM - 1,  BBNUM - 1,  // B8-BB
     BCNUM - 1,  BDNUM - 1,  BENUM - 1,  BFNUM - 1,  // BC-BF

 //===========================
     C0NUM - 1,  C1NUM - 1,  C2NUM - 1,  C3NUM - 1,  // C0-C3
     C4NUM - 1,  C5NUM - 1,  C6NUM - 1,  C7NUM - 1,  // C4-C7
     C8NUM - 1,  C9NUM - 1,  CANUM - 1,  CBNUM - 1,  // C8-CB
     CCNUM - 1,  CDNUM - 1,  CENUM - 1,  0,          // CC-CF

 //===========================
     0,      //  eepromCheckWord

 //===========================
     0,      //  掉电记忆

 //===========================
     U0NUM -34, U1NUM - 1, U2NUM - 1, U3NUM - 0,     // U0, 显示
     U4NUM - 1, U5NUM - 1, U6NUM - 1, U7NUM - 1,
     U8NUM - 1, U9NUM - 1, UANUM - 1, UBNUM - 1,
     UCNUM - 1, UDNUM - 1, UENUM - 1, 0,
};

// 每一group的开始功能码的index
// 对每一功能码，currentIndex = GetGradeIndex(group, grade) = funcCodeGradeSum[group]+grade;
const Uint16 funcCodeGradeSum[FUNCCODE_GROUP_NUM] =
{
//============================================
    GetCodeIndex(funcCode.group.f0[0]),         // F0
    GetCodeIndex(funcCode.group.f1[0]),         // F1
    GetCodeIndex(funcCode.group.f2[0]),         // F2
    GetCodeIndex(funcCode.group.f3[0]),         // F3

    GetCodeIndex(funcCode.group.f4[0]),         // F4
    GetCodeIndex(funcCode.group.f5[0]),         // F5
    GetCodeIndex(funcCode.group.f6[0]),         // F6
    GetCodeIndex(funcCode.group.f7[0]),         // F7

    GetCodeIndex(funcCode.group.f8[0]),         // F8
    GetCodeIndex(funcCode.group.f9[0]),         // F9
    GetCodeIndex(funcCode.group.fa[0]),         // FA
    GetCodeIndex(funcCode.group.fb[0]),         // FB

    GetCodeIndex(funcCode.group.fc[0]),         // FC
    GetCodeIndex(funcCode.group.fd[0]),         // FD
    GetCodeIndex(funcCode.group.fe[0]),         // FE
    GetCodeIndex(funcCode.group.ff[0]),         // FF

//============================================
    GetCodeIndex(funcCode.group.fp[0]),         // FP

//============================================
    GetCodeIndex(funcCode.group.a0[0]),         // A0
    GetCodeIndex(funcCode.group.a1[0]),         // A1
    GetCodeIndex(funcCode.group.a2[0]),         // A2
    GetCodeIndex(funcCode.group.a3[0]),         // A3

    GetCodeIndex(funcCode.group.a4[0]),         // A4
    GetCodeIndex(funcCode.group.a5[0]),         // A5
    GetCodeIndex(funcCode.group.a6[0]),         // A6
    GetCodeIndex(funcCode.group.a7[0]),         // A7

    GetCodeIndex(funcCode.group.a8[0]),         // A8
    GetCodeIndex(funcCode.group.a9[0]),         // A9
    GetCodeIndex(funcCode.group.aa[0]),         // AA
    GetCodeIndex(funcCode.group.ab[0]),         // AB

    GetCodeIndex(funcCode.group.ac[0]),         // AC
    GetCodeIndex(funcCode.group.ad[0]),         // AD
    GetCodeIndex(funcCode.group.ae[0]),         // AE
    GetCodeIndex(funcCode.group.af[0]),         // AF

//============================================
    GetCodeIndex(funcCode.group.b0[0]),         // B0
    GetCodeIndex(funcCode.group.b1[0]),         // B1
    GetCodeIndex(funcCode.group.b2[0]),         // B2
    GetCodeIndex(funcCode.group.b3[0]),         // B3

    GetCodeIndex(funcCode.group.b4[0]),         // B4
    GetCodeIndex(funcCode.group.b5[0]),         // B5
    GetCodeIndex(funcCode.group.b6[0]),         // B6
    GetCodeIndex(funcCode.group.b7[0]),         // B7

    GetCodeIndex(funcCode.group.b8[0]),         // B8
    GetCodeIndex(funcCode.group.b9[0]),         // B9
    GetCodeIndex(funcCode.group.ba[0]),         // BA
    GetCodeIndex(funcCode.group.bb[0]),         // BB

    GetCodeIndex(funcCode.group.bc[0]),         // BC
    GetCodeIndex(funcCode.group.bd[0]),         // BD
    GetCodeIndex(funcCode.group.be[0]),         // BE
    GetCodeIndex(funcCode.group.bf[0]),         // BF

//============================================
    GetCodeIndex(funcCode.group.c0[0]),         // C0
    GetCodeIndex(funcCode.group.c1[0]),         // C1
    GetCodeIndex(funcCode.group.c2[0]),         // C2
    GetCodeIndex(funcCode.group.c3[0]),         // C3

    GetCodeIndex(funcCode.group.c4[0]),         // C4
    GetCodeIndex(funcCode.group.c5[0]),         // C5
    GetCodeIndex(funcCode.group.c6[0]),         // C6
    GetCodeIndex(funcCode.group.c7[0]),         // C7

    GetCodeIndex(funcCode.group.c8[0]),         // C8
    GetCodeIndex(funcCode.group.c9[0]),         // C9
    GetCodeIndex(funcCode.group.ca[0]),         // CA
    GetCodeIndex(funcCode.group.cb[0]),         // CB

    GetCodeIndex(funcCode.group.cc[0]),         // CC
    GetCodeIndex(funcCode.group.cd[0]),         // CD
    GetCodeIndex(funcCode.group.ce[0]),         // CE
    GetCodeIndex(funcCode.group.cf[0]),         // CF

//============================================
    GetCodeIndex(funcCode.group.fChk[0]),       // eepromCheckWord

//============================================
    GetCodeIndex(funcCode.group.remember[0]),   // 掉电记忆

//============================================
    GetCodeIndex(funcCode.group.u0[0]),         // U0
    GetCodeIndex(funcCode.group.u1[0]),         // U1
    GetCodeIndex(funcCode.group.u2[0]),         // U2
    GetCodeIndex(funcCode.group.u3[0]),         // U3

    GetCodeIndex(funcCode.group.u4[0]),         // U4
    GetCodeIndex(funcCode.group.u5[0]),         // U5
    GetCodeIndex(funcCode.group.u6[0]),         // U6
    GetCodeIndex(funcCode.group.u7[0]),         // U7

    GetCodeIndex(funcCode.group.u8[0]),         // U8
    GetCodeIndex(funcCode.group.u9[0]),         // U9
    GetCodeIndex(funcCode.group.ua[0]),         // UA
    GetCodeIndex(funcCode.group.ub[0]),         // UB

    GetCodeIndex(funcCode.group.uc[0]),         // UC
    GetCodeIndex(funcCode.group.ud[0]),         // UD
    GetCodeIndex(funcCode.group.ue[0]),         // UE
    GetCodeIndex(funcCode.group.uf[0]),         // UF
};

// 功能码的属性表，上限、下限、属性。
// 不包括 (EEPROM_CHK、掉电记忆、)显示



const FUNCCODE_ATTRIBUTE funcCodeAttribute[FNUM_PARA] =
{
 //  F0 下限             F0 上限             F0 出厂值       F0 属性 F0-EEPROM地址
 {   1,                  2,                  1,              0x1040, 64 ,           },//F0-00 GP类型显示
 {   0,                  2,                  0,              0x0840, 65 ,           },//F0-01 第一电机控制方式
 {   0,                  2,                  0,              0x0040, 66 ,           },//F0-02 运行指令选择
 {   0,                  9,                  0,              0x0840, 67 ,           },//F0-03 主频率输入选择
 {   0,                  9,                  0,              0x0840, 68 ,           },//F0-04 辅助频率源Y选择
 {   0,                  1,                  0,              0x0040, 69 ,           },//F0-05 辅助频率源Y范围选择
 {   0,                  150,                100,            0x00F0, 70 ,           },//F0-06 辅助频率源Y范围
 {   0,                  34,                 0,              0x4080, 71 ,           },//F0-07 频率源选择
 {   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 72 ,           },//F0-08 预置频率
 {   0,                  1,                  0,              0x0040, 73 ,           },//F0-09 运行方向
 {   5000,               50000,             5000,            0x094A, 74 ,           },//F0-10 最大频率
 {   0,                  5,                  0,              0x0840, 75 ,           },//F0-11 上限频率源
 {   LOWER_FRQ_INDEX,    MAX_FRQ_INDEX,      5000,           0x074A, 76 ,           },//F0-12 上限频率数值设定
 {   0,                  MAX_FRQ_INDEX,      0,              0x034A, 77 ,           },//F0-13 上限频率偏置
 {   0,                  UPPER_FRQ_INDEX,    0,              0x034A, 78 ,           },//F0-14 下限频率数值设定
 {   5,                  160,                60,             0x00C1, 79 ,           },//F0-15 载波频率
 {   0,                  1,                  1,              0x0040, 80 ,           },//F0-16 载波频率随温度调整
 {   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 81 ,           },//F0-17 加速时间1
 {   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 82 ,           },//F0-18 减速时间1
 {   0,                  2,                  1,              0x0840, 83 ,           },//F0-19 加减速时间的单位
 {   0,                  8,                  0,              0x1140, 84 ,           },//F0-20 辅助频率源偏置选择
 {   0,                  MAX_FRQ_INDEX,      0,              0x034A, 85 ,           },//F0-21 辅助频率源偏置的数字设定
 {   2,                  2,                  2,              0x1840, 86 ,           },//F0-22 频率指令小数点
 {   0,                  0x1 ,               0,              0x0040, 87 ,           },//F0-23 数值设定频率记忆设定
 {   0,                  1,                  0,              0x0840, 88 ,           },//F0-24 电机选择
 {   0,                  2,                  0,              0x0840, 89 ,           },//F0-25 加减速时间基准频率
 {   0,                  1,                  0,              0x0840, 90 ,           },//F0-26 运行时UP/DN频率基准
 {   0,                  9999,               0,              0x4040, 91 ,           },//F0-27 命令源捆绑频率源
 {   0,                  1,                  0,              0x0840, 92 ,           },//F0-28 通信协议选择
 //  F1 下限             F1 上限             F1 出厂值       F1 属性 F1-EEPROM地址
 // 电机基本参数
 {   2,                  2,                  2,              0x0840, 93 ,           },//F1-00 电机类型选择
 {   1,                  10000,              37,             0x0941, 94 ,           },//F1-01 电机额定功率
 {   1,                  2000,               380,            0x08E0, 95 ,           },//F1-02 电机额定电压
 {   1,                  65535,              900,            0x0952, 96 ,           },//F1-03 电机额定电流
 {   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 97 ,           },//F1-04 电机额定频率
 {   1,                  65535,              1460,           0x0958, 98 ,           },//F1-05 电机额定转速
 // 异步机调谐参数
 {   1,                  65535,              1204,           0x1943, 99 ,           },//F1-06 异步机定子电阻
 {   1,                  65535,              908,            0x1943, 100 ,          },//F1-07 异步机转子电阻
 {   1,                  65535,              528,            0x1942, 101 ,          },//F1-08 异步机漏感抗
 {   1,                  65535,              1586,           0x1941, 102 ,          },//F1-09 异步机互感抗
 {   1,                  RATING_CUR_INDEX,   424,            0x1B52, 103 ,          },//F1-10 异步机空载电流
 {   0,                  65535,              0,              0x1140, 104 ,          },//F1-11 保留
 {   0,                  65535,              0,              0x1140, 105 ,          },//F1-12 保留
 {   0,                  65535,              0,              0x1140, 106 ,          },//F1-13 保留
 {   0,                  65535,              0,              0x1140, 107 ,          },//F1-14 保留
 {   0,                  65535,              0,              0x1140, 108 ,          },//F1-15 保留
 // 同步机调谐参数
 {   1,                  65535,              0,              0x0943, 109 ,          },//F1-16 同步机定子电阻
 {   1,                  65535,              0,              0x0942, 110 ,          },//F1-17 同步机d轴电感
 {   1,                  65535,              0,              0x0942, 111 ,          },//F1-18 同步机q轴电感
 {   0,                  12   ,                 0,           0x1180, 112 ,          },//F1-19 同步机电感电阻单位
 {   0,                  65535,             3000,            0x0961, 113 ,          },//F1-20 同步机反电动势系数
 {   0,                  60000,                 0,           0x1943, 114 ,          },//F1-21 同步机输出缺相检测时间
 {   0,                  65535,              0,              0x1140, 115 ,          },//F1-22 保留
 {   0,                  65535,              0,              0x1140, 116 ,          },//F1-23 保留
 {   0,                  65535,              0,              0x1140, 117 ,          },//F1-24 保留
 {   0,                  65535,              0,              0x1140, 118 ,          },//F1-25 保留
 {   0,                  65535,              0,              0x1140, 119 ,          },//F1-26 保留
 // PG卡参数
 {   1,                  65535,              1024,           0x0940, 120 ,          },//F1-27 编码器脉冲线数
 {   0,                      4,              0,              0x0940, 121 ,          },//F1-28 编码器类型
 {   0,                      2,              0,              0x0940, 122 ,          },//F1-29 速度反馈PG卡选择, 0-QEP1,1-QEP2(扩展)
 {   0,                      1,              0,              0x0840, 123 ,          },//F1-30 编码器相序/主方向
 {   0,                   3599,              0,              0x0901, 124 ,          },//F1-31 编码器安装角
 {   0,                      1,              0,              0x0840, 125 ,          },//F1-32 UVW信号方向
 {   0,                   3599,              0,              0x0901, 126,           },//F1-33 UVW信号零点位置角
 {   1,                  65535,              1,              0x0940, 127 ,          },//F1-34 旋变极对 数
 {   1,                  65535,              4,              0x1140, 128 ,          },//F1-35 UVW极对数
 {   0,                    100,              0,              0x08C1, 129 ,          },//F1-36 速度反馈PG断线检测时间
 // 调谐
 {   0,                  12,                 0,              0x4040, 130,           },//F1-37 调谐选择
               
 //  F2 下限             F2 上限             F2 出厂值       F2 属性 F2-EEPROM地址
 {   1,                  100,                30,             0x00C0, 131 ,           },// F2-00 速度环比例增益1
 {   1,                  1000,               50,             0x0102, 132 ,           },// F2-01 速度环积分时间1
 {   0,                  VC_CHG_FRQ2_INDEX,  500,            0x034A, 133 ,           },// F2-02 切换频率1
 {   1,                  100,                20,             0x00C0, 134 ,           },// F2-03 速度环比例增益2
 {   1,                  1000,               100,            0x0102, 135 ,           },// F2-04 速度环积分时间2
 {   VC_CHG_FRQ1_INDEX,  MAX_FRQ_INDEX,      1000,           0x074A, 136 ,           },// F2-05 切换频率2
 {   50,                 200,                100,            0x00F0, 137 ,           },// F2-06 速度环积分属性
 {   0,                  1000,               50,             0x0143, 138 ,           },// F2-07 速度环滤波时间常数
 {   0,                  200,                64,             0x00C0, 139 ,           },// F2-08 矢量控制过励磁增益
 {   0,                  7,                  0,              0x0040, 140 ,           },// F2-09 速度控制(驱动)转矩上限源
 {   0,                  2000,               1500,           0x0131, 141 ,           },// F2-10 速度控制(驱动)转矩上限数字设定
 {   0,                  7,                  0,              0x0040, 142 ,           },// F2-11 速度控制(制动)转矩上限源
 {   0,                  2000,               1500,           0x0131, 143 ,           },// F2-12 速度控制(制动)转矩上限数字设定
 {   0,                  60000,              2000,           0x0140, 144 ,           },// F2-13 M轴电流环Kp
 {   0,                  60000,              1300,           0x0140, 145 ,           },// F2-14 M轴电流环Ki
 {   0,                  60000,              2000,           0x0140, 146 ,           },// F2-15 T轴电流环Kp
 {   0,                  60000,              1300,           0x0140, 147 ,           },// F2-16 T轴电流环Ki
 {   0,                     1,               0,              0x4080, 148 ,           },// F2-17 速度环积分属性
 {   0,                      2,              1,              0x0040, 149 ,           },// F2-18 同步机弱磁模式
 {     0,                50,                  5,             0x00C0, 150 ,           },// F2-19 同步机弱磁系数
 {   1,                  300,                 50,            0x08F0, 151 ,           },// F2-20 最大弱磁电流
 {   10,                  500,               100,            0x00F0, 152 ,           },// F2-21 弱磁自动调谐系数
 {   0,                     1,               0,              0x0840, 153 ,           },// F2-22 发电转矩上限使能
 {   1,                   50,                5,              0x00F0, 154,            },// F2-23 同步机输出电压上限裕量
 {   50,                  180,               80,             0x08F0, 155 ,           },// F2-24 同步机初始位置角检测电流
 {   0,                  2,                  0,              0x0040, 156 ,           },// F2-25 同步机初始位置角检测
 {   0,                  1,                  0,              0x1140, 157 ,           },// F2-26 速度环模式选择
 {   50,                 500,                100,            0x0040, 158 ,           },// F2-27,同步机凸极率调整增益
 {   1,                  1,                   0,             0x0040, 159 ,           },// F2-28,最大转矩电流比控制
 {   0,                  0,                  0,              0x1140, 160 ,           },// F2-29 前馈补偿模式
 {   1,                  100,                6,              0x0140, 161 ,           },// F2-30 调谐时电流环KP
 {   1,                 100,                6,               0x0140, 162 ,           },// F2-31 调谐时电流环KI
 {   0,                  1,                  1,              0x0040, 163 ,           },// F2-32 Z信号校正使能
 {   10,                 1000,               100,            0x0840, 164 ,           },// F2-33 同步机SVC速度滤波级别
 {   5,                  200,                40,             0x0840, 165 ,           },// F2-34 同步机SVC速度估算比例增益
 {   5,                  200,                30,             0x0040, 166 ,           },// F2-35 同步机SVC速度估算积分增益
 {   0,                  80,                 30,             0x00F0, 167 ,           },// F2-36 同步机SVC初始励磁电流限幅
 {   8,                  CARRIER_FRQ_INDEX,   15,            0x02A1, 168 ,           },// F2-37 同步机SVC最低载波频率
 {   0,                  1,                  0,              0x0140, 169 ,           },// F2-38 低频运行方式
 {   0,                  1000,               200,            0x0140, 170 ,           },// F2-39 低频生效
 {   5,                  10000,              10,             0x0141, 171 ,           },// F2-40 低频频率步长
 {   0,                  80,                  50,            0x00F0, 172 ,           },// F2-41 低频制动电流
 {   0,                  1,                   0,             0x0040, 173 ,           },// F2-42 同步机SVC速度跟踪
 {   0,                  1,                   0,             0x0040, 174 ,           },// F2-43 零伺服使能
 {   0,                  VC_CHG_FRQ1_INDEX,   30,            0x034A, 175 ,           },// F2-44 切换频率
 {   1,                  100,                10,             0x0040, 176 ,           },// F2-45 零伺服速度环比例增益
 {   1,                  1000,               50,             0x0102, 177 ,           },// F2-46 零伺服速度环积分时间
 {   0,                  1,                   0,             0x0040, 178 ,           },// F2-47 停机禁止反转
 {   0,                  100,                 8,             0x0101, 179 ,           },// F2-48 停机角度
 {   0,                    2,                 0,             0x0140, 180 ,           },// F2-49 在线调谐使能0:关闭1:上电第一次运行前调谐2:运行前调谐
 {   0,                  1,                  0,              0x0840, 181 ,           },// F2-50 在线反电动势辨识0:关闭1:开启
 {   0,                  3600,               0,              0x0141, 182 ,           },// F2-51 SVC初始位置补偿角度
 //  F3 下限             F3 上限             F3 出厂值       F3 属性 F3-EEPROM地址
{  0,                    11,                       0,                  0x0840,  183, },// F3-00 VF曲线设定
{  0,                    300,                      10,                 0x00F1,  184, },// F3-01 转矩提升
{  0,                    MAX_FRQ_INDEX,            5000,               0x0B4A,  185, },// F3-02 转矩提升截止频率
{  0,                    VF_FRQ2_INDEX,            0,                  0x0B4A,  186, },// F3-03 多点VF频率点1
{  0,                    1000,                     0,                  0x0931,  187, },// F3-04 多点VF电压点1
{  VF_FRQ1_INDEX,        VF_FRQ3_INDEX,            0,                  0x0F4A,  188, },// F3-05 多点VF频率点2
{  0,                    1000,                     0,                  0x0931,  189, },// F3-06 多点VF电压点2
{  VF_FRQ2_INDEX,        RATING_FRQ_INDEX,         0,                  0x0F4A,  190, },// F3-07 多点VF频率点3
{  0,                    1000,                     0,                  0x0931,  191, },// F3-08 多点VF电压点3
{  0,                    2000,                     0,                  0x0131,  192, },// F3-09 转差补偿系数
{  0,                    200,                      64,                 0x00C0,  193, },// F3-10 VF过励磁增益
{  0,                    100,                      0,                  0x00C0,  194 ,},// F3-11 振荡抑制增益
{  0,                     4,                       3,                  0x0840,  195 ,},// F3-12 振荡抑制模式选择
{  0,                     8,                       0,                  0x0140,  196 ,},// F3-13 VF分离的电压源
{  0,                    RATING_VOL_INDEX,         0,                  0x0340,  197 ,},// F3-14 VF分离的电压源数字设定
{  0,                    10000,                    0,                  0x0141,  198 ,},// F3-15 VF分离的电压上升时间
{  0,                    10000,                    0,                  0x0141,  199 ,},// F3-16 VF分离的电压时间
{  0x0000,               0x0001,                   0x0000,             0x0840,  200 ,},// F3-17 VF分离停机方式
{  0x0032,               0x00C8,                   0x0082,             0x0840,  201 ,},// F3-18 过流失速电流
{  0x0000,               0x0001,                   0x0001,             0x0840,  202 ,},// F3-19 过流失速使能
{  0x0000,               0x0064,                   0x0014,             0x0040,  203 ,},// F3-20 过流失速增益
{  0x0032,               0x00C8,                   0x0032,             0x0840,  204 ,},// F3-21 倍速过流补偿
{  0x1964,               0x1F40,                   0x1DB0,             0x0841,  205 ,},// F3-22 过压失速电压
{  0x0000,               0x0001,                   0x0000,             0x0840,  206 ,},// F3-23 过压失速使能
{  0x0000,               0x0064,                   0x001E,             0x0040,  207 ,},// F3-24 过压频率增益
{  0x0000,               0x0064,                   0x001E,             0x0040,  208 ,},// F3-25 过压电压增益
{  0x0000,               0x0032,                   0x0005,             0x0840,  209 ,},// F3-26 过压频率限制
{  0x0001,               0x0064,                   0x0005,             0x0041,  210 ,},// F3-27 转差补偿常数
{  0x0000,               0x0001,                   0x0000,             0x0840,  211 ,},// F3-28~48 VF参数组   MD500
{  0x000A,               0x0064,                   0x0032,             0x0840,  212 ,},// F3-29
{  0x000A,               0x0064,                   0x0014,             0x0840,  213 ,},// F3-30
{  0x0000,               0x0064,                   0x0032,             0x0040,  214 ,},// F3-31
{  0x0000,               0x0064,                   0x0032,             0x0040,  215 ,},// F3-32
{  0x0050,               0x0096,                   0x0064,             0x0840,  216 ,},// F3-33
{  0x0000,               0xFFFF,                   0x0000,             0x0040,  217 ,},// F3-34
{  0x0000,               0xFFFF,                   0x0000,             0x0040,  218 ,},// F3-35
{  0x0000,               0xFFFF,                   0x0000,             0x0040,  219 ,},// F3-36
//  F4 下限             F4 上限             F4 出厂值       F4 属性 F4-EEPROM地址
{   0,                  DI_FUNC_NUMBER-1,   1,              0x0880, 220 ,            },// F4-00 DI1端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   4,              0x0880, 221 ,            },// F4-01 DI2端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   9,              0x0880, 222 ,            },// F4-02 DI3端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   12,             0x0880, 223 ,            },// F4-03 DI4端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   13,             0x0880, 224 ,            },// F4-04 DI5端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 225 ,            },// F4-05 DI6端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 226 ,            },// F4-06 DI7端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 227 ,            },// F4-07 DI8端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 228 ,            },// F4-08 DI9端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 229 ,            },// F4-09 DI10端子功能选择
{   0,                  1000,               10,             0x0083, 230 ,            },// F4-10 DI滤波时间
{   0,                  3,                  0,              0x0840, 231 ,            },// F4-11 端子命令方式
{   1,                  65535,              1000,           0x014B, 232 ,            },// F4-12 端子UP/DOWN速率，改为0.001Hz
{   0,                  CURVE1_MAX_INDEX,   0,              0x2322, 233 ,            },// F4-13 AI曲线1最小输入
{   (Uint16)(-1000),    1000,               0,              0x2131, 234 ,            },// F4-14 AI曲线1最小输入对应设定
{   CURVE1_MIN_INDEX,   1000,               1000,           0x2522, 235 ,            },// F4-15 AI曲线1最大输入
{   (Uint16)(-1000),    1000,               1000,           0x2131, 236 ,            },// F4-16 AI曲线1最大输入对应设定
{   0,                  1000,               10,             0x0102, 237 ,            },// F4-17 AI1滤波时间
{   0,                  CURVE2_MAX_INDEX,   0,              0x2322, 238 ,            },// F4-18 AI曲线2最小输入
{   (Uint16)(-1000),    1000,               0,              0x2131, 239 ,            },// F4-19 AI曲线2最小输入对应设定
{   CURVE2_MIN_INDEX,   1000,               1000,           0x2522, 240 ,            },// F4-20 AI曲线2最大输入
{   (Uint16)(-1000),    1000,               1000,           0x2131, 241 ,            },// F4-21 AI曲线2最大输入对应设定
{   0,                  1000,               10,             0x0102, 242 ,            },// F4-22 AI2滤波时间
{   (Uint16)(-1000),    CURVE3_MAX_INDEX,   (Uint16)-1000,  0x2322, 243 ,            },// F4-23 AI曲线3最小输入
{   (Uint16)(-1000),    1000,               (Uint16)-1000,  0x2131, 244 ,            },// F4-24 AI曲线3最小输入对应设定
{   CURVE3_MIN_INDEX,   1000,               1000,           0x2522, 245 ,            },// F4-25 AI曲线3最大输入
{   (Uint16)(-1000),    1000,               1000,           0x2131, 246 ,            },// F4-26 AI曲线3最大输入对应设定
{   0,                  1000,               10,             0x0102, 247 ,            },// F4-27 AI3滤波时间
{   0        ,          PULSE_IN_MAX_INDEX, 0,              0x0302, 248 ,            },// F4-28 PULSE最小输入
{   0xFC18   ,          1000 ,              0,              0x2131, 249 ,            },// F4-29 PULSE最小输入对应设定
{   PULSE_IN_MIN_INDEX, 10000,              5000,           0x0502, 250 ,            },// F4-30 PULSE最大输入
{   0xFC18   ,          1000 ,              1000,           0x2131, 251 ,            },// F4-31 PULSE最大输入设定
{   0        ,          1000 ,              10,             0x0102, 252 ,            },// F4-32 PULSE滤波时间
{   0x0111,             0x0555,             0x0321,         0x8140, 253 ,            },// F4-33 AI设定曲线选择
{   0x0000,             0x0111,             0x0000,         0x80B0, 254 ,            },// F4-34 AI低于最小输入设定选择
{   0,                  36000,              0,              0x0141, 255 ,            },// F4-35 DI1延迟时间
{   0,                  36000,              0,              0x0141, 256 ,            },// F4-36 DI21延迟时间
{   0,                  36000,              0,              0x0141, 257 ,            },// F4-37 DI31延迟时间
{   0,                  11111,              0,              0x4940, 258 ,            },// F4-38 DI端子有效模式选择1
{   0,                  11111,              0,              0x4940, 259 ,            },// F4-39 DI端子有效模式选择1
{   0,                  1,                  0,              0x0840, 260 ,            },// F4-40
//  F5 下限             F5 上限             F5 出厂值       F5 属性 F5-EEPROM地址
{   0,         FUNCCODE_FM_OUT_SELECT_MAX,  0,              0x0040, 261 ,           },// F5-00  多功能端子输出选
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 262 ,           },// F5-01  FMR输出选择
{   0,                  (DO_FUNC_NUMBER-1), 2,              0x0080, 263 ,           },// F5-02  控制板RELAY输出选择
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 264 ,           },// F5-03  扩展卡RELAY输出选择
{   0,                  (DO_FUNC_NUMBER-1), 1,              0x0080, 265 ,           },// F5-04  DO1输出选择
{   0,                  (DO_FUNC_NUMBER-1), 4,              0x0080, 266 ,           },// F5-05  扩展卡DO2输出选择
{   0,                  16,                 0,              0x0080, 267 ,           },// F5-06  FMP输出选择
{   0,                  16,                 0,              0x0080, 268 ,           },// F5-07  AO1输出选择
{   0,                  16,                 1,              0x0080, 269 ,           },// F5-08  扩展卡AO2输出选择
{   1,                  10000,              5000,           0x00C2, 270 ,           },// F5-09  FMP输出最大频率
{   0xFC18,             1000,               0,              0x2131, 271 ,           },// F5-10  AO1零偏系数
{   0xFC18,             1000,               100,            0x2102, 272 ,           },// F5-11  AO1增益
{   0xFC18,             1000,               0,              0x2131, 273 ,           },// F5-12  AO2零偏系数
{   0xFC18,             1000,               100,            0x2102, 274 ,           },// F5-13  AO2增益
{   0,                  1000,               0,              0x1102, 275 ,           },// F5-14  AO1
{   0,                  1000,               0,              0x1102, 276 ,           },// F5-15  AO2滤波时间
{   0,                  1000,               0,              0x1102, 277 ,           },// F5-16  HDO滤波时间
{   0,                  36000,              0,              0x0141, 278 ,           },// F5-17  realy1输出延迟时间，0.1s
{   0,                  36000,              0,              0x0141, 279 ,           },// F5-18  realy2输出延迟时间，0.1s
{   0,                  36000,              0,              0x0141, 280 ,           },// F5-19  DO1输出延迟时间
{   0,                  36000,              0,              0x0141, 281 ,           },// F5-20  DO2输出延迟时间
{   0,                  36000,              0,              0x0141, 282 ,           },// F5-21  DO3输出延迟时间
{   0,                  11111,              0,              0x4140, 283 ,           },// F5-22  DO有效状态选择
{   0,                  1,                  0,              0x0840, 284 ,           },// F5-23  AO1电压电流输出选择
//  F6 下限             F6 上限             F6 出厂值       F6 属性 F6-EEPROM地址
#if DEBUG_MD290_SEARIS
{   0,                  1,                  0,              0x0040, 285 ,           },// 206
{   0,                  4,                  0,              0x0840, 286 ,           },
#else
{   0,                  2,                  0,              0x0040, 285 ,           },// F6-00  启动方式
{   0,                  2,                  0,              0x0840, 286 ,           },// F6-01  转速跟踪方式
#endif
{   1,                  100,                20,             0x00C0, 287 ,           },// F6-02  转速跟踪快慢
{   0,                  1000,               0,              0x010A, 288 ,           },// F6-03  启动频率
{   0,                  1000,               0,              0x08C1, 289 ,           },// F6-04  启动频率保持时间
{   0,                  100,                0,              0x08F0, 290 ,           },// F6-05  启动直流制动电流
{   0,                  1000,               0,              0x0901, 291 ,           },// F6-06  启动直流制动时间
{   0,                  2,                  0,              0x0840, 292 ,           },// F6-07  加减速方式
{   0,                  1000,             300,              0x0931, 293 ,           },// F6-08  S曲线开始段时间比例
{   0,                  1000,             300,              0x0931, 294 ,           },// F6-09  S曲线结束段时间比例
{   0,                  1,                  0,              0x0040, 295 ,           },// F6-10  停机方式
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 296 ,           },// F6-11  停机直流制动起始频率
{   0,                  1000,               0,              0x00C1, 297 ,           },// F6-12  停机直流制动等待时间
{   0,                  100,                0,              0x00F0, 298 ,           },// F6-13  停机直流制动电流
{   0,                  1000,               0,              0x00C1, 299 ,           },// F6-14  停机直流制动时间
{   0,                  100,                100,            0x00F0, 300 ,           },// F6-15  制动使用率
{   0,                  65000,               0,             0x0040, 301 ,           },// F6-16  制动管持续开通允许时间
{   0,                  1000,               800,            0x0040, 302 ,           },// F6-17  转速跟踪闭环电流KP
{   30,                 200,                100,            0x0840, 303 ,           },// F6-18  转速跟踪闭环电流KI
{   10,                 100,                30,             0x0840, 304 ,           },// F6-19  转速跟踪闭环电流大小
{   5,                  30,                 10,             0x0841, 305 ,           },// F6-20  转速跟踪闭环电流下限定值
{   0,                  500,                100,            0x0842, 306 ,           },// F6-21  转速跟踪电压上升时间
{   0,                  65000,              0,              0x0040, 307 ,           },// F6-22  去磁时间
{   0,                  65535,              0,              0x0040, 308 ,           },// F6-23  保留
{   0,                  65535,              0,              0x0040, 309 ,           },// 24
{   0,                  65535,              0,              0x0040, 310 ,           },// 25
{   0,                  65535,              0,              0x0040, 311 ,           },// 26
//  F7 下限             F7 上限             F7 出厂值       F7 属性 F7-EEPROM地址
{   0,                  1,                  0,              0x1040, 312 ,           },// F7-00  数码管缺画检验使能
{   0,                  4,                  0,              0x0840, 313 ,           },// F7-01  MFK键功能
{   0,                  1,                  1,              0x0040, 314 ,           },// F7-02  STOP/RESET键功能
{   0,                  0xFFFF,             0x1F,           0x8140, 315 ,           },// F7-03  LED运行显示参数1
{   0,                  0xFFFF,             0,              0x8140, 316 ,           },// F7-04  LED运行显示参数2
{   1,                  0xFFFF,             0x33,           0x8140, 317 ,           },// F7-05  停机显示参数
{   1,                  65000,              10000,          0x0144, 318 ,           },// F7-06  负载速度显示系数
{   0,                  999,                0,              0x30C0, 319 ,           },// F7-07  逆变器模块散热器温度
{   0,                  65535,              0,              0x1142, 320 ,           },// F7-08  产品号
{   0,                  65535,              0,              0x1140, 321 ,           },// F7-09  累计运行时间,单位:h
{   0,                  65535,              0,              0x1142, 322 ,           },// F7-10  性能版本号
{   0,                  65535,              0,              0x1142, 323 ,           },// F7-11  功能版本号
{   10,                  23,               21,              0x4040, 324 ,           },// F7-12  负载速度显示小数点位置
{   0,                  65535,              0,              0x1140, 325 ,           },// F7-13  累计上电时间
{   0,                  65535,              0,              0x1140, 326 ,           },// F7-14  累计耗电量
{   0,                  65535,              0,              0x1142, 327 ,           },// F7-15
{   0,                  65535,              0,              0x1142, 328 ,           },// F7-16

//  F8 下限             F8 上限             F8 出厂值       F8 属性 F8-EEPROM地址
{   0,                  MAX_FRQ_INDEX,      200,            0x034A, 329 ,           },// F8-00  点动运行频率
{   0,                  65000,              200,            0x0141, 330 ,           },// F8-01  点动加速时间
{   0,                  65000,              200,            0x0141, 331 ,           },// F8-02  点动减速时间
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 332 ,           },// F8-03  加速时间2
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 333 ,           },// F8-04  减速时间2
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 334 ,           },// F8-05  加速时间3
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 335 ,           },// F8-06  减速时间3
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 336 ,           },// F8-07  加速时间4
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 337 ,           },// F8-08  减速时间4
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 338 ,           },// F8-09  跳跃频率1
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 339 ,           },// F8-10  跳跃频率2
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 340 ,           },// F8-11  跳跃频率幅度
{   0,                  30000,              0,              0x0141, 341 ,           },// F8-12  正反转死区时间
{   0,                  1,                  0,              0x0040, 342 ,           },// F8-13  反转控制,0-允许反转，1-禁止反转
{   0,                  2,                  0,              0x0040, 343 ,           },// F8-14  频率低于下限频率运行动作
{   0,                  1000,               0,              0x010A, 344 ,           },// F8-15  下垂控制
{   0,                  65000,              0,              0x0040, 345 ,           },// F8-16  设定上电到达时间
{   0,                  65000,              0,              0x0140, 346 ,           },// F8-17  设定运行到达时间
{   0,                  1,                  0,              0x0040, 347 ,           },// F8-18  启动保护选择
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 348 ,           },// F8-19  频率检测值(FDT电平)
{   0,                  1000,               50,             0x0131, 349 ,           },// F8-20  频率检测滞后值
{   0,                  1000,               0,              0x0131, 350 ,           },// F8-21  频实检出幅度
{   0,                  1,                  0,              0x0040, 351 ,           },// F8-22  加减速过程中跳跃频率是否有效
{   0,                  1,                  0,              0x1840, 352 ,           },// F8-23  设定上电时间到达动作选择
{   0,                  1,                  0,              0x1840, 353 ,           },// F8-24  设定运行时间到达动作选择
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 354 ,           },// F8-25  加速时间1/2切换频率点
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 355 ,           },// F8-26  减速时间1/2切换频率点
{   0,                  1,                  0,              0x0040, 356 ,           },// F8-27  端子点动优先
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 357 ,           },// F8-28  频率到达检测值2
{   0,                  1000,               50,             0x0131, 358 ,           },// F8-29  频率检测滞后值2
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 359 ,           },// F8-30  任意频率到达检测值1
{   0,                  1000,               0,              0x0131, 360 ,           },// F8-31  任意频率到达检出1幅度
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 361 ,           },// F8-32  任意频率到达检测值2
{   0,                  1000,               0,              0x0131, 362 ,           },// F8-33  任意频率到达检出2幅度
{   0,                  3000,               50,             0x0131, 363 ,           },// F8-34  零电流检测
{   1,                  60000,              10,             0x0142, 364 ,           },// F8-35  零电流检测延迟时间
{   0,                  3000,               2000,           0x0131, 365 ,           },// F8-36  软件过流点
{   0,                  60000,              0,              0x0142, 366 ,           },// F8-37  软件过流检测延迟时间
{   0,                  3000,               1000,           0x0131, 367 ,           },// F8-38  电流到达检测值1
{   0,                  3000,               0,              0x0131, 368 ,           },// F8-39  电流到达检测1幅度
{   0,                  3000,               1000,           0x0131, 369 ,           },// F8-40  电流到达检测值2
{   0,                  3000,               0,              0x0131, 370 ,           },// F8-41  电流到达检测2幅度
{   0,                     1,               0,              0x0840, 371 ,           },// F8-42  定时功能选择
{   0,                     3,               0,              0x0840, 372 ,           },// F8-43  定时时间设定选择
{   0,                 65000,               0,              0x0941, 373 ,           },// F8-44  定时运行时间
{   0,             AI1_UPPER,               310,            0x0322, 374 ,           },// F8-45  AI1输入电压下限
{   AI1_LIMIT,          1100,               680,            0x0522, 375 ,           },// F8-46  AI1输入电压上限
{   0,                   100,                75,            0x0100, 376 ,           },// F8-47  模块温度到达
{   0,                     1,                 0,            0x0840, 377 ,           },// F8-48  风扇控制
{   WAKE_UP_LIMIT,      MAX_FRQ_INDEX,        0,            0x074A, 378 ,           },// F8-49  唤醒频率
{   0,                 65000,                 0,            0x0141, 379 ,           },// F8-50  唤醒延迟时间
{   0,                  DORMANT_UPPER,        0,            0x034A, 380 ,           },// F8-51  休眠频率
{   0,                 65000,                 0,            0x0141, 381 ,           },// F8-52  休眠延迟时间
{   0,                 65000,               0,              0x0941, 382 ,           },// F8-53  当前运行到达时间
{   0,                 2000,             1000,              0x0131, 383,            },// F8-54  输出功率校正系数
{   0,                 2000,             1000,              0x0131, 384,            },// F8-55  输出电流校正系数
{   0,                 1,                0,                 0x0140, 385,            },// F8-56  输出电压显示方式
//  F9 下限             F9 上限             F9 出厂值       F9 属性 F9-EEPROM地址
{   0,                  1,                  1,              0x0040, 386 ,           },// F9-00  电机过载保护选择
{   20,                 1000,               100,            0x0102, 387 ,           },// F9-01  电机过载保护增益
{   50,                 100,                80,             0x00F0, 388 ,           },// F9-02  电机过载保护增益
{   0,                  100,                0,              0x00C0, 389 ,           },// F9-03  过压失速增益
{   2000,                 22000,          20000,            0x0921, 390 ,           },// F9-04  过压失速保护电压
{   0,                  100,                20,             0x00C0, 391,            },// F9-05  过流失速增益
{   50,                 200,                150,            0x08F0, 392 ,           },// F9-06  过流失速保护电流
{   0,                  11,                11,              0x4040, 393 ,           },// F9-07  对地短路保护功能
#if DEBUG_MD500_SEARIS
{  6500,               8000,               7800,            0x0061, 394 ,           },
#elif DEBUG_MD290_SEARIS
{  6500,               8000,               7800,            0x0061, 394 ,           },
#else
{  2000,               20000,              6900,            0x1140, 394 ,           },// F9-08  过压制动阀值
#endif
{   0,                  20,                 0,              0x0040, 395 ,           },// F9-09  故障自动复位次数
{   0,                  1,                  0,              0x0040, 396 ,           },// F9-10  故障自动复位期间故障继电器动作选择
{   1,                  1000,               10,             0x0101, 397 ,           },// F9-11  故障自动复位间隔时间,0.1s
#if DEBUG_MD500_SEARIS||DEBUG_MD290_SEARIS
{   0,                  12,                 11,             0x4040, 398 ,           },
#else
{   0,                  11,                 11,             0x4040, 398 ,           },// F9-12  输入缺相保护选择
#endif
{   0,                  11,                11,              0x4040, 399 ,           },// F9-13  输出缺相保护选择
{   0,                  99,                 0,              0x1080, 400 ,           },// F9-14  第一次故障类型
{   0,                  99,                 0,              0x1080, 401 ,           },// F9-15  第二次故障类型
{   0,                  99,                 0,              0x1080, 402 ,           },// F9-16  第三次(最近一次)故障类型
{   0,                  65535,              0,              0x114A, 403 ,           },// F9-17  第三次(最近一次)故障时频率
{   0,                  65535,              0,              0x1152, 404 ,           },// F9-18  第三次(最近一次)故障时电流
{   0,                  65535,              0,              0x1161, 405 ,           },// F9-19  第三次(最近一次)故障时母线电压
{   0,                  9999,               0,              0x1100, 406 ,           },// F9-20  第三次(最近一次)故障时输入端子状态
{   0,                  9999,               0,              0x1100, 407 ,           },// F9-21  第三次(最近一次)故障时输出端子状态
{   0,                  65535,              0,              0x1100, 408 ,           },// F9-22  第三次(最近一次)故障时变频器状态
{   0,                  65535,              0,              0x1100, 409 ,           },// F9-23  第三次(最近一次)故障时时间（从本次上电开始计时）
{   0,                  65535,              0,              0x1101, 410 ,           },// F9-24  第三次(最近一次)故障时时间（从运行时开始计时）
{   0,                  65535,              0,              0x1161, 411 ,           },// F9-25  第三次(最近一次)故障时的反电动势
{   0,                  65535,              0,              0x1040, 412 ,           },// F9-26  保留

{   0,                  65535,              0,              0x114A, 413 ,           },// F9-27  第二次故障时频率
{   0,                  65535,              0,              0x1152, 414 ,           },// F9-28  第二次故障时电流
{   0,                  65535,              0,              0x1161, 415 ,           },// F9-29  第二次故障时母线电压
{   0,                  9999,               0,              0x1100, 416 ,           },// F9-30  第二次故障时输入端子状态
{   0,                  9999,               0,              0x1100, 417 ,           },// F9-31  第二次故障时输出端子状态
{   0,                  65535,              0,              0x1100, 418 ,           },// F9-32  第二次故障时变频器状态
{   0,                  65535,              0,              0x1100, 419 ,           },// F9-33  第二次故障时时间（从本次上电开始计时）
{   0,                  65535,              0,              0x1101, 420 ,           },// F9-34  第二次故障时时间（从运行时开始计时）
{   0,                  65535,              0,              0x1161, 421 ,           },// F9-35  第二次故障时的反电动势
{   0,                  65535,              0,              0x1040, 422 ,           },// F9-36  保留

{   0,                  65535,              0,              0x114A, 423 ,           },// F9-37  第一次故障时频率
{   0,                  65535,              0,              0x1152, 424 ,           },// F9-38  第一次故障时电流
{   0,                  65535,              0,              0x1161, 425 ,           },// F9-39  第一次故障时母线电压
{   0,                  9999,               0,              0x1100, 426 ,           },// F9-40  第一次故障时输入端子状态
{   0,                  9999,               0,              0x1100, 427 ,           },// F9-41  第一次故障时输出端子状态
{   0,                  65535,              0,              0x1100, 428 ,           },// F9-42  第一次故障时变频器状态
{   0,                  65535,              0,              0x1100, 429 ,           },// F9-43  第一次故障时时间（从本次上电开始计时）
{   0,                  65535,              0,              0x1101, 430 ,           },// F9-44  第一次故障时时间（从运行时开始计时）
{   0,                  65535,              0,              0x1161, 431 ,           },// F9-45  第一次故障时的反电动势
{   0,                  65535,              0,              0x1040, 432 ,           },// F9-46  保留

{   0,                  22222,              0,              0x4040, 433 ,           },// F9-47  故障时保护动作选择1
{   0,                  22210,              0,              0x4040, 434 ,           },// F9-48  故障时保护动作选择2
{   0,                  22222,              0,              0x4040, 435 ,           },// F9-49  故障时保护动作选择3
{   0,                  22222,              0,              0x4040, 436 ,           },// F9-50  故障时保护动作选择4
{   0,                      0,              0,              0x5040, 437 ,           },// F9-51  故障时保护动作选择5

{   0,                  65535,              0,              0x1040, 438 ,           },// F9-52  故障指示选择1
{   0,                  65535,              0,              0x1040, 439 ,           },// F9-53  故障指示选择2
{   0,                      4,              0,              0x0040, 440 ,           },// F9-54  故障时继续运行频率选择
{   0,                   1000,           1000,              0x0131, 441 ,           },// F9-55  异常备用频率设定

{   0,                  2,                  0,              0x0040, 442 ,           },// F9-56  电机温度传感器类型
{   0,                  200,              110,              0x00C0, 443 ,           },// F9-57  电机过热保护阈值
{   0,                  200,               90,              0x00C0, 444 ,           },// F9-58  电机过热预报警阈值

{   0,                   2,                 0,              0x4840, 445 ,           },// F9-59  瞬停不停功能选择
{   80,                 100,                90,             0x0930, 446 ,           },// F9-60  瞬停不停频率切换点
{   0,                  1000,               5,              0x0941, 447 ,           },// F9-61  瞬停不停电压回升判断时间
{   60,                 100,                80,             0x0930, 448 ,           },// F9-62  瞬停不停动作判断电压
{   0,                  1,                  0,              0x0040, 449 ,           },// F9-63  掉载保护功能
{   0,                  1000,               100,            0x0131, 450 ,           },// F9-64  掉载检出水平
{   0,                  600,                10,             0x00C1, 451 ,           },// F9-65  掉载检出时间
{   0,                0x222,                 0,             0x90C0, 452 ,           },// F9-66  故障频率的小数点
{   0,                  500,                200,            0x0131, 453 ,           },// F9-67  过速度检测值
{   0,                  600,                10,             0x00C1, 454 ,           },// F9-68  过速度检测时间
{   0,                  500,                200,            0x0131, 455 ,           },// F9-69  速度偏差过大检测值
{   0,                  600,                50,             0x00C1, 456 ,           },// F9-70  速度偏差过大检测时间
{   0,                  100,                40,             0x0040, 457 ,           },// F9-71  瞬停不停增益
{   0,                  100,                30,             0x0040, 458 ,           },// F9-72  瞬停不停积分系数
{   0,                  3000,               200,            0x0041, 459 ,           },// F9-73  瞬停不停动作减速时间
{  0x0000,              0x0001,             0x0001,         0x0140, 460 ,           },// F9-74 UVW编码器故障(Err20)使能
{  0x0000,              0x000B,             0x000B,         0x4040, 461 ,           },// F9-75 故障保护动作/带载调谐故障/初始位置故障使能
{   0,                  1,                  1,              0x0140, 462 ,           },// F9-76 编码器断线检测使能
{   0,                  11,                 11,             0x4040, 463 ,           },// F9-77 过载曲线
{   0,                  65535,              0,              0x0040, 464 ,           },// F9-78 保留
{   0,                  65535,              0,              0x0040, 465 ,           },// F9-79
{   0,                  65535,              0,              0x0040, 466 ,           },// F9-80
//  FA 下限             FA 上限             FA 出厂值       FA 属性 FA-EEPROM地址
{   0,                  6,                  0,              0x0040, 467 ,           },// FA-00  PID给定源
{   0,                  1000,               500,            0x0131, 468 ,           },// FA-01  PID数值给定, 0.1%
{   0,                  8,                  0,              0x0040, 469 ,           },// FA-02  PID反馈源
{   0,                  1,                  0,              0x0040, 470 ,           },// FA-03  PID作用方向
{   0,                  65535,              1000,           0x0140, 471 ,           },// FA-04  PID给定反馈量程
{   0,                   1000,              200,            0x0101, 472 ,           },// FA-05  比例增益P
{   1,                  1000,               200,            0x0102, 473 ,           },// FA-06  积分时间I
{   0,                  10000,              0,              0x0103, 474 ,           },// FA-07  微分时间D
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 475 ,           },// FA-08  PID反转截止频率
{   0,                  1000,               0,              0x0131, 476 ,           },// FA-09  PID偏差极限
{   0,                10000,                10,             0x00F2, 477 ,           },// FA-10  PID微分限幅
{   0,                  65000,              0,              0x0102, 478 ,           },// FA-11  PID给定变化时间
{   0,                  6000,               0,              0x0102, 479 ,           },// FA-12  PID反馈滤波时间
{   0,                  6000,               0,              0x0102, 480 ,           },// FA-13  PID输出滤波时间
{   0,                  65535,              0,              0x0140, 481 ,           },// FA-14  PID采样周期(暂未做)
{   0,                   1000,              200,            0x0101, 482 ,           },// FA-15  PID比例增益P2
{   1,                  1000,               200,            0x0102, 483 ,           },// FA-16  PID积分时间I2
{   0,                  10000,              0,              0x0103, 484 ,           },// FA-17  PID微分时间D2
{   0,                  3,                  0,              0x0040, 485 ,           },// FA-18  PID参数切换条件
{   0,         PID_PARA_CHG_DELTA1_MAX,     200,            0x0331, 486 ,           },// FA-19  PID参数切换偏差1
{PID_PARA_CHG_DELTA2_MIN,1000,              800,            0x0531, 487 ,           },// FA-20  PID参数切换偏差2
{   0,                  1000,               0,              0x0131, 488 ,           },// FA-21  PID初值
{   0,                  65000,              0,              0x0102, 489 ,           },// FA-22  PID初值保持时间
{   0,                10000,                100,            0x00F2, 490 ,           },// FA-23  PID两次输出之间偏差的最大值
{   0,                10000,                100,            0x00F2, 491 ,           },// FA-24  PID两次输出之间偏差的最小值
{   0,                  11,                 0,              0x4040, 492 ,           },// FA-25  PID积分属性
{   0,                  1000,               0,              0x0131, 493 ,           },// FA-26  PID反馈丢失检测值
{   0,                  200,                0,              0x00C1, 494 ,           },// FA-27  PID反馈丢失检测时间
{   0,                  1,                  1,              0x0040, 495 ,           },// FA-28  PID运算模式(停机是否运算). 供水模式下，停机时PID也计算.
//  FB 下限             FB 上限             FB 出厂值       FB 属性 FB-EEPROM地址
{   0,                  1,                  0,              0x0040, 496 ,           },// FB-00  摆频设定方式
{   0,                  1000,               0,              0x0131, 497 ,           },// FB-01  摆频幅度
{   0,                  500,                0,              0x00F1, 498 ,           },// FB-02  突跳频率幅度
{   1,                  30000,              100,            0x0141, 499 ,           },// FB-03  摆频周期
{   1,                  1000,               500,            0x0131, 500 ,           },// FB-04  摆频的三角波上升时间
{   0,                  65535,              1000,           0x0140, 501 ,           },// FB-05  设定长度
{   0,                  65535,              0,              0x0140, 502 ,           },// FB-06  实际长度
{   1,                  65535,              1000,           0x0141, 503 ,           },// FB-07  每米脉冲数，单位: 0.1
{   1,                  65535,              1000,           0x0140, 504 ,           },// FB-08  设定计数值
{   1,                  65535,              1000,           0x0140, 505 ,           },// FB-09  指定计数值
//  FC 下限             FC 上限             FC 出厂值       FC 属性 FC-EEPROM地址
{   (Uint16)(-1000),    1000,               0,              0x2131, 506 ,           },// FC-00  --FC-15   多段指令0-多段指令15
{   (Uint16)(-1000),    1000,               0,              0x2131, 507 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 508 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 509 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 510 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 511 ,           },  // 5
{   (Uint16)(-1000),    1000,               0,              0x2131, 512 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 513 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 514 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 515 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 516 ,           },  // 10
{   (Uint16)(-1000),    1000,               0,              0x2131, 517 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 518 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 519 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 520 ,           },
{   (Uint16)(-1000),    1000,               0,              0x2131, 521 ,           },  // 15
{   0,                  2,                  0,              0x0040, 522 ,           },// FC-16  PLC运行方式
{   0,                  11,                 0,              0x4080, 523 ,           },// FC-17  PLC掉电记忆选择
{   0,                  65000,              0,              0x0141, 524 ,           },// FC-18  --FC-49   PLC运行时间，加减速时间选择
{   0,                  3,                  0,              0x0040, 525 ,           },
{   0,                  65000,              0,              0x0141, 526 ,           },  // 20
{   0,                  3,                  0,              0x0040, 527 ,           },
{   0,                  65000,              0,              0x0141, 528 ,           },
{   0,                  3,                  0,              0x0040, 529 ,           },
{   0,                  65000,              0,              0x0141, 530 ,           },
{   0,                  3,                  0,              0x0040, 531 ,           },  // 25
{   0,                  65000,              0,              0x0141, 532 ,           },
{   0,                  3,                  0,              0x0040, 533 ,           },
{   0,                  65000,              0,              0x0141, 534 ,           },
{   0,                  3,                  0,              0x0040, 535 ,           },
{   0,                  65000,              0,              0x0141, 536 ,           },  // 30
{   0,                  3,                  0,              0x0040, 537 ,           },
{   0,                  65000,              0,              0x0141, 538 ,           },
{   0,                  3,                  0,              0x0040, 539 ,           },
{   0,                  65000,              0,              0x0141, 540 ,           },
{   0,                  3,                  0,              0x0040, 541 ,           },  // 35
{   0,                  65000,              0,              0x0141, 542 ,           },
{   0,                  3,                  0,              0x0040, 543 ,           },
{   0,                  65000,              0,              0x0141, 544 ,           },
{   0,                  3,                  0,              0x0040, 545 ,           },
{   0,                  65000,              0,              0x0141, 546 ,           },  // 40
{   0,                  3,                  0,              0x0040, 547 ,           },
{   0,                  65000,              0,              0x0141, 548 ,           },
{   0,                  3,                  0,              0x0040, 549 ,           },
{   0,                  65000,              0,              0x0141, 550 ,           },
{   0,                  3,                  0,              0x0040, 551 ,           },  // 45
{   0,                  65000,              0,              0x0141, 552 ,           },
{   0,                  3,                  0,              0x0040, 553 ,           },
{   0,                  65000,              0,              0x0141, 554 ,           },
{   0,                  3,                  0,              0x0040, 555 ,           },
{   0,                  1,                  0,              0x0040, 556 ,           },// FC-50  PLC运行时间单位
{   0,                  6,                  0,              0x0040, 557 ,           },// FC-51  多段指令0给定方式
//  FD 下限             FD 上限             FD 出厂值       FD 属性 FD-EEPROM地址
{   0,                  6009,            5005,              0x6040, 558 ,           },// FD-00  波特率
{   0,                  3,                  0,              0x0040, 559 ,           },// FD-01  数据格式
{   1,                  247,                1,              0x00C0, 560 ,           },// FD-02  本机地址
{   0,                  20,                 2,              0x0080, 561 ,           },// FD-03  应答延迟
{   0,                  600,                0,              0x00C1, 562 ,           },// FD-04  串口通讯超时时间
{   0,                  31,                30,              0x2040, 563 ,           },// FD-05  通讯数据传送格式选择
{   0,                  1,                  0,              0x0040, 564 ,           },// FD-06  通讯读取电流分辨率
{   0,                  1,                  0,              0x0040, 565 ,           },// FD-07  通讯主从方式
{   0,                  600,                0,              0x00C1, 566 ,           },// FD-08  扩展卡通讯中断检
{   0,                  1,                  0,              0x0040, 567 ,           },// FD-09  通信卡设定速度类型 0 频率 1 转速
//  FE 下限             FE 上限             FE 出厂值       FE 属性 FE-EEPROM地址       // 280有320没有的功能码
{   0,                  65535,             10,              0x0140, 568 ,           },// FE 用户定制功能码组
{   0,                  65535,             2,               0x0140, 569 ,           },
{   0,                  65535,              3,              0x0140, 570 ,           },
{   0,                  65535,              7,              0x0140, 571 ,           },
{   0,                  65535,              8,              0x0140, 572 ,           },
{   0,                  65535,              17,             0x0140, 573 ,           },  // 5
{   0,                  65535,              18,             0x0140, 574 ,           },
{   0,                  65535,              300,            0x0140, 575 ,           },
{   0,                  65535,              301,            0x0140, 576 ,           },
{   0,                  65535,              400,            0x0140, 577 ,           },
{   0,                  65535,              401,            0x0140, 578 ,           },  // 10
{   0,                  65535,              402,            0x0140, 579 ,           },
{   0,                  65535,              504,            0x0140, 580 ,           },
{   0,                  65535,              507,            0x0140, 581 ,           },
{   0,                  65535,              600,            0x0140, 582 ,           },
{   0,                  65535,              610,            0x0140, 583 ,           },  // 15
{   0,                  65535,              0,              0x0140, 584 ,           },
{   0,                  65535,              0,              0x0140, 585 ,           },
{   0,                  65535,              0,              0x0140, 586 ,           },
{   0,                  65535,              0,              0x0140, 587 ,           },
{   0,                  65535,               0,             0x0140, 588 ,           },  // 20
{   0,                  65535,              0,              0x0140, 589 ,           },
{   0,                  65535,              0,              0x0140, 590 ,           },
{   0,                  65535,              0,              0x0140, 591 ,           },
{   0,                  65535,              0,              0x0140, 592 ,           },
{   0,                  65535,              0,              0x0140, 593 ,           },  // 25
{   0,                  65535,              0,              0x0140, 594 ,           },
{   0,                  65535,              0,              0x0140, 595 ,           },
{   0,                  65535,              0,              0x0140, 596 ,           },
{   0,                  65535,              0,              0x0140, 597 ,           },
{   0,                  65535,              0,              0x0140, 598 ,           },  // 30
{   0,                  65535,              0,              0x0140, 599 ,           },  // 31 518
                                                                                                                                                  
//  FF 下限             FF 上限             FF 出厂值       FF 属性 FF-EEPROM地址
{   0  ,                65535,              0   ,           0x0140, 600 ,           },// FF-00   厂家密码 519      1430
{   1  ,                537  ,              11  ,           0x0880, 601 ,           },// FF-01   机型
{   1  ,                2    ,              1   ,           0x0840, 602 ,           },// FF-02   G/P型号
{   0  ,                65535,              37  ,           0x1141, 603 ,           },// FF-03   变频器功率
{   1  ,                4    ,              1   ,           0x0840, 604 ,           },// FF-04   温度曲线
{   900,                1100 ,              1000,           0x0931, 605 ,           },// FF-05   UV两相增益偏差
{   0,                  65535 ,              0,             0x1902, 606 ,           },// FF-06
{   0,                  65535 ,              0,             0x1902, 607 ,           },// FF-07
{   850,                1400 ,              1000,           0x0131, 608 ,           },// FF-08   电压校正系数
{   850,                1150 ,              1000,           0x0131, 609 ,           },// FF-09   电流校正系数
{   0,                  3040 ,              0,              0x0140, 610 ,           },// FF-10   性能调试显示个数
{   0,                  0x111,              0,              0x8840, 611 ,           },// FF-11  AIAO校正功能码显示
{   0x0000,             0xBFFF,             0x8836,         0x8140, 612 ,           },// FF-12  内存地址查看
//  FP 下限             FP 上限             FP 出厂值       FP 属性 FP-EEPROM地址
{   0,                  65535,              0,              0x0140, 613 ,           },// FP-00   用户密码 532
{   0,     PARA_INIT_MODE_MAX,              0,              0x0840, 614 ,           },// FP-01   参数初始化
{   0,                     11,             11,              0x4040, 615 ,           },// FP-02   菜单模式
{   0,                     11,              0,              0x4040, 616 ,           },// FP-03  个性化参数模式选择
{   0,                      1,              0,              0x0140, 617 ,           },// FP-04  功能码属性修改
{   0,                  65535,              0,              0x0140, 618 ,           },// 5           537

//=========================================================================================================
//  A0-AF
//=========================================================================================================

//  A0 下限             A0 上限             A0 出厂值       A0 属性 A0-EEPROM地址
{   0,                  1,                  0,              0x0840, 619 ,           },// A0-00  转矩控制
{   0,                  7,                  0,              0x0840, 620 ,           },// A0-01  驱动转矩上限源
{   0,                  5,                  0,              0x1040, 621 ,           },// A0-02  制动转矩上限源
{(Uint16)(-2000),       2000,               1500,           0x2131, 622 ,           },// A0-03  驱动转矩上限
{   0,                  1000,               0,              0x0142, 623 ,           },// A0-04  转矩滤波
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 624 ,           },// A0-05  转矩控制正向最大频率
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 625 ,           },// A0-06  转矩控制反向最大频率
{   0,                  65000,              0,              0x0142, 626 ,           },// A0-07  转矩加速时间
{   0,                  65000,              0,              0x0142, 627 ,           },// A0-08  转矩减速时间
//  A1 下限             A1 上限             A1 出厂值       A1 属性 A1-EEPROM地址
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 628 ,           },// A1-00  --A1-04 VDI1端子功能选择
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 629 ,           },// 1
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 630 ,           },// 2
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 631 ,           },// 3
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 632 ,           },// 4
{   0,                  11111,              0,              0x4940, 633 ,           },// A1-05  VDI端子有效状态来源
{   0,                  11111,              0,              0x4140, 634 ,           },// A1-06  VDI端子功能码设定有效状态
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 635 ,           },// A1-07  --A1-09 AI1端子功能选择（当作DI）
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 636 ,           },// 8
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 637 ,           },// 9
{   0,                  111,                0,              0x4940, 638 ,           },// A1-10  AI作为DI有效状态选择
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 639 ,           },// A1-11  --A1-15 虚拟VDO1～VDO5输出选择
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 640 ,           },// 12
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 641 ,           },// 13
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 642 ,           },// 14
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 643 ,           },// 15
{   0,                  36000     ,         0,              0x0141, 644 ,           },// 16   VDO1输出延迟时间，0.1s
{   0,                  36000     ,         0,              0x0141, 645 ,           },// 17   VDO2输出延迟时间，0.1s
{   0,                  36000     ,         0,              0x0141, 646 ,           },// 18   VDO3输出延迟时间
{   0,                  36000     ,         0,              0x0141, 647 ,           },// 19   VDO4输出延迟时间
{   0,                  36000     ,         0,              0x0141, 648 ,           },// 20   VDO5输出延迟时间
{   0,                  11111     ,         0,              0x4080, 649 ,           },// 21   DO有效状态选择
                                                                                                                                                  
//  A2 下限             A2 上限             A2 出厂值       A2 属性 A2-EEPROM地址
{   2,                  2,                  2,              0x0840, 650 ,           },  // 0  第2电机参数
{   1,                  65535,              37,             0x0941, 651 ,           },  // 1
{   1,                  2000,               380,            0x08E0, 652 ,           },  // 2
{   1,                  65535,              900,            0x0952, 653 ,           },  // 3
{   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 654 ,           },  // 4

{   1,                  65535,              1460,           0x0958, 655 ,           },  // 5
{   1,                  65535,              1204,           0x0943, 656 ,           },  // 6  异步机定子电阻
{   1,                  65535,              908,            0x0943, 657 ,           },  // 7
{   1,                  65535,              528,            0x0942, 658 ,           },  // 8
{   1,                  65535,              1586,           0x0941, 659 ,           },  // 9

{   1,                  RATING_CUR_INDEX2,  424,            0x0B52, 660 ,           },  // 10 空载电流
{   0,                  65535,              0,              0x1140, 661 ,           },  // 11
{   0,                  65535,              0,              0x1140, 662 ,           },  // 12
{   0,                  65535,              0,              0x1140, 663 ,           },  // 13
{   0,                  65535,              0,              0x1140, 664 ,           },  // 14

{   0,                  65535,              0,              0x1140, 665 ,           },  // 15
{   1,                  65535,              1204,           0x0943, 666 ,           },  // 16 同步机定子电阻
{   1,                  65535,              1586,           0x0942, 667 ,           },  // 17
{   1,                  65535,              1586,           0x0942, 668 ,           },  // 18
{   1,                  65535,              0,              0x1180, 669 ,           },  // 19

{   0,                  65535,              3000,           0x0961, 670 ,           },  // 20
{   0,                  60000,              0,              0x1943, 671 ,           },  // 21
{   0,                  65535,              0,              0x1140, 672 ,           },  // 22
{   0,                  65535,              0,              0x1140, 673 ,           },  // 23
{   0,                  65535,              0,              0x1140, 674 ,           },  // 24

{   0,                  65535,              0,              0x1140, 675 ,           },  // 25
{   0,                  65535,              0,              0x1140, 676 ,           },  // 26
// PG卡参数
{   1,                  65535,              1024,           0x0940, 677  ,          },  // 27
{   0,                      4,              0,              0x0940, 678  ,          },  // 28
{   0,                      2,              0,              0x0940, 679  ,          },  // 29

{   0,                      1,              0,              0x0840, 680  ,          },  // 30 旋变方向
{   0,                   3599,              0,              0x0901, 681  ,          },  // 31 编码器安装位置角
{   0,                      1,              0,              0x0840, 682  ,          },  // 32 UVW信号方向
{   0,                   3599,              0,              0x0901, 683  ,          },  // 33 UVW信号零点位置角
{   1,                  65535,              1,              0x0840, 684  ,          },  // 34 旋变极对数

{   1,                  65535,              4,              0x0901, 685  ,          },  // 35 UVW极对数
{   0,                    100,              0,              0x08C1, 686  ,          },  // 36 速度反馈PG断线检测时间
// 调谐
{   0,                  12,                 0,              0x4040, 687  ,          },  // 37 调谐选择
// 矢量控制参数
{   1,                  100,                30,             0x00C0, 688  ,          },  // 38
{   1,                  1000,               50,             0x0102, 689 ,           },  // 39

{   0,                  VC_CHG_FRQ2_INDEX2, 500,           0x034A, 690 ,           },  // 40
{   1,                  100,                20,            0x00C0, 691 ,           },  // 41
{   1,                  1000,               100,           0x0102, 692 ,           },  // 42
{   VC_CHG_FRQ1_INDEX2, MAX_FRQ_INDEX,      1000,          0x074A, 693 ,           },  // 43
{   50,                 200,                100,           0x00F0, 694 ,           },  // 44

{   0,                  1000,               50,            0x0143, 695 ,           },  // 45
{   0,                  200,                64,            0x00C0, 696 ,           },  // 46
{   0,                  7,                  0,             0x0040, 697 ,           },  // 47
{   0,                  2000,               1500,          0x0131, 698 ,           },  // 48
{   0,                  7,                  0,             0x0040, 699 ,           },  // 49

{   0,                  2000,               1500,          0x0131, 700 ,           },  // 50
{   0,                  60000,              2000,          0x0140, 701 ,           },  // 51
{   0,                  60000,              1300,          0x0140, 702 ,           },  // 52
{   0,                  60000,              2000,          0x0140, 703 ,           },  // 53
{   0,                  60000,              1300,          0x0140, 704 ,           },  // 54
{   0,                     1,               0,             0x4080, 705 ,           },  // 55
{   0,                      2,              1,             0x0040, 706 ,           },  // 56
{   0,                      50,              10,           0x00F0, 707 ,           },  // 57
{   100,                  110,              105,           0x1140, 708 ,           },  // 58
{   2,                    10,                 2,           0x0040, 709 ,           },  // 59

{   0,                      1,                0,           0x0840, 710 ,           },  // 60
// 控制方式
#if DEBUG_MD290_SEARIS
{   2,                  2,                  2,             0x1040, 711 ,           },  // 61
#else
{   0,                  2,                  0,             0x0040, 711 ,           },  // 61
#endif
{   0,                  4,                  0,             0x0040, 712 ,           },  // 62
{   0,                  300,                10,            0x00F1, 713 ,           },  // 63
{   0,                    11,               0,             0x5040, 714 ,           },  // 64
{   0,                  100,                0,             0x00C0, 715 ,           },  // 65,
{   1,                   50,                5,             0x00F0, 716 ,           },//  66,
{   50,                  180,               80,            0x08F0, 717 ,           },// 67,
{   0,                  2,                  0,             0x0040, 718 ,           }, //68,
{   0,                  1,                  0,             0x1140, 719 ,           },// 69,
{   50,                 500,                100,           0x0040, 720 ,           }, // 70,
{   1,                  1,                   0,            0x0040, 721 ,           }, // 71,
{   0,                  0,                  0,             0x1140, 722 ,           },// 72,
{   1,                  100,                6,              0x0140, 723 ,          },// 73,
{   1,                 100,                6,               0x0140, 724 ,          },// 74,
{   0,                  1,                  1,              0x0040, 725 ,          },// 75,
{   10,                 1000,               100,            0x0840, 726 ,          },// 76,
{   5,                  200,                40,             0x0840, 727 ,          },// 77,
{   5,                  200,                30,             0x0040, 728 ,          },  // 78,
{   0,                  80,                 30,             0x00F0, 729 ,          },  // 79,
{   8,                  CARRIER_FRQ_INDEX,   20,            0x02A1, 730 ,          },  // 80,
{   0,                  1,                  0,              0x0140, 731 ,          },  // 81,
{   0,                  1000,               200,            0x0140, 732 ,          },  // 82,
{   5,                  10000,              10,            0x0141, 733 ,           },  // 83,
{   0,                  80,                  50,           0x00F0, 734 ,           },  // 84,
{   0,                  1,                   0,            0x0040, 735 ,           },  // 85,
{   0,                  1,                   0,            0x0040, 736 ,           },  // 86,
{   0,                  VC_CHG_FRQ1_INDEX,   30,           0x034A, 737 ,           },  // 87,
{   1,                  100,                10,             0x0040, 738 ,           },  // 88,
{   1,                  1000,               50,             0x0102, 739 ,           },  // 89,
{   0,                  1,                   0,              0x0040, 740 ,           },  // 90,
{   0,                  100,                 8,              0x0101, 741 ,           },  // 91,
//  A3 下限             A3 上限             A3 出厂值       A3 属性 A3-EEPROM地址
{   0,                  0,                  0,              0x0940, 742 ,           },  // 0,661

//  A4 下限             A4 上限             A4 出厂值       A4 属性 A4-EEPROM地址
{   0,                  0,                  0,              0x0940, 743 ,           },  // 0

//  A5 下限             A5 上限             A5 出厂值       A5 属性 A0-EEPROM地址
{   500,                 MAX_FRQ_INDEX,    1200,            0x034A, 744 ,           },// A5-00  DPWM切换上限频率
{   0,                      1,              0,              0x0140, 745 ,           },// A5-01  调制方式，0-异步调制，1-同步调制
{   0,                      1,              1,              0x0140, 746 ,           },// A5-02    死区补偿模式选择
{   0,                     10,              0,              0x0140, 747 ,           },// A5-03    随机PWM
{   0,                      1,              1,              0x0140, 748 ,           },// A5-04    逐波限流使能
{  100,                   120,             110,             0x0100, 749 ,           },// A5-05    过调制系数  电流检测延时补偿更改为过调制系数
#if DEBUG_MD500_SEARIS
{ 600,                  1400,           1000,               0x0131, 750 ,           },  // 6
{   2,                      2,              2,              0x0940, 751 ,           },  // 7
#elif DEBUG_MD290_SEARIS
{ 600,                  1400,           1000,               0x0131, 750 ,           },  // 6
{   2,                      2,              2,              0x0940, 751 ,           },  // 7
#else
{ 600,                  1400,           1000,               0x0131, 750 ,           },// A5-06    欠压点设置
{   1,                      2,              2,              0x0940, 751 ,           },// A5-07    SVC优化选择 0-不优化  1-优化模式1  2-优化模式2
#endif
{ 100,                    200,            150,              0x08F0, 752 ,           },// A5-08    死区时间调整-1140V专用
#if DEBUG_MD500_SEARIS
{ 6500,                 8200,            8200,              0x0921, 753 ,           },  // 9
#elif DEBUG_MD290_SEARIS
{ 6500,                 8200,            8200,              0x0921, 753 ,           },  // 9
#else
{ 2000,                 22000,          20000,              0x0921, 753 ,           },// A5-09    过压点设置
#endif

//  A6 下限             A6 上限             A6 出厂值       A6 属性 A6-EEPROM地址
{   (Uint16)(-1000),  CURVE4_INFLEX1_INDEX, 0,              0x2322, 754 ,           },// A6-00    --A6-07  曲线4，4点，最大值，最小值，2个中间点
{   (Uint16)(-1000),    1000,               0,              0x2131, 755 ,           },// 1
{  CURVE4_MIN_INDEX,  CURVE4_INFLEX2_INDEX, 300,            0x2722, 756 ,           },// 2
{   (Uint16)(-1000),    1000,               300,            0x2131, 757 ,           },// 3
{  CURVE4_INFLEX1_INDEX,  CURVE4_MAX_INDEX, 600,            0x2722, 758 ,           },// 4,
{   (Uint16)(-1000),    1000,               600,            0x2131, 759 ,           },// 5,
{  CURVE4_INFLEX2_INDEX,1000,               1000,           0x2522, 760 ,           },// 6,
{   (Uint16)(-1000),    1000,               1000,           0x2131, 761 ,           },// 7,
{   (Uint16)(-1000),  CURVE5_INFLEX1_INDEX, (Uint16)-1000,  0x2322, 762 ,           },// A6-08    --A6-15  曲线5，4点
{   (Uint16)(-1000),    1000,               (Uint16)-1000,  0x2131, 763 ,           },// 9
{  CURVE5_MIN_INDEX,  CURVE5_INFLEX2_INDEX, (Uint16)-300,   0x2722, 764 ,           },// 10
{   (Uint16)(-1000),    1000,               (Uint16)-300,   0x2131, 765 ,           },// 11
{  CURVE5_INFLEX1_INDEX, CURVE5_MAX_INDEX,  300,            0x2722, 766 ,           },// 12
{   (Uint16)(-1000),    1000,               300,            0x2131, 767 ,           },// 13,
{  CURVE5_INFLEX2_INDEX,1000,               1000,           0x2522, 768 ,           },// 14
{   (Uint16)(-1000),    1000,               1000,           0x2131, 769 ,           },// 15,
{   0,                     0,               0,              0x1040, 770 ,           },// 16,
{   0,                     0,               0,              0x1040, 771 ,           },// 17,
{   0,                     0,               0,              0x1040, 772 ,           },// 18.
{   0,                     0,               0,              0x1040, 773 ,           },// 19,
{   0,                     0,               0,              0x1040, 774 ,           },// 20,
{   0,                     0,               0,              0x1040, 775 ,           },// 21,
{   0,                     0,               0,              0x1040, 776 ,           },// 22.
{   0,                     0,               0,              0x1040, 777 ,           },// 23,
{   (Uint16)(-1000),    1000,               0,              0x2131, 778 ,           },// A6-24 --A6-29, AI1, AI2, AI3跳跃
{   0,                  1000,               5,              0x0131, 779 ,           },// 25
{   (Uint16)(-1000),    1000,               0,              0x2131, 780 ,           },// 26
{   0,                  1000,               5,              0x0131, 781 ,           },// 27
{   (Uint16)(-1000),    1000,               0,              0x2131, 782 ,           },// 28
{   0,                  1000,               5,              0x0131, 783 ,           },// 29,

//  A7 下限             A7 上限             A7 出厂值       A7 属性 A7-EEPROM地址
{   0,                  1,                  0,              0x0840, 784 ,           },// A7-00 PLC卡功能选择
{   0,              11111,                  0,              0x4940, 785 ,           },// A7-01 输出端子控制
{   0,                  7,                  0,              0x0840, 786 ,           },// A7-02 PLC AI3功能配置
{   0,               1000,                  0,              0x0131, 787 ,           },// A7-03 FMP输出
{   0,               1000,                  0,              0x0131, 788 ,           },// A7-04 AO1输出
{   0,                111,                  0,              0x40C0, 789 ,           },// A7-05 开关量输出
{ (Uint16)(-10000), 10000,                  0,              0x2172, 790 ,           },// A7-06 PLC卡频率给定
{ (Uint16)(-2000),   2000,                  0,              0x2131, 791 ,           },// A7-07 PLC卡转矩给定
{   0,              65535,                  0,              0x0140, 792 ,           },// A7-08 PLC卡命令给定
{   0,              65535,                  0,              0x0140, 793 ,           },// A7-09 PLC卡故障给定
{   0,                  1,                  0,              0x0840, 794 ,           },// 10  保留
{   0,                  1,                  0,              0x0840, 795 ,           },// 11,
//  A8 下限             A8 上限             A8 出厂值       A8 属性 A8-EEPROM地址
{   0,                  1,                  0,              0x0800, 796 ,           },// A8-00 主从控制有效   0:无效   1:有效
{   0,                  1,                  0,              0x0800, 797 ,           },// A8-01 主从选择       0:主机   1:从机
{   0,                  111,               11,              0x4840, 798 ,           },// A8-02 从机跟随主机命令
#if DEBUG_MD290_SEARIS
{   1,                  1,                  1,              0x0800, 799 ,           },  // 3
#else
{   0,                  1,                  0,              0x0800, 799 ,           },// A8-03 从机接收数据   0:转矩给定  1:频率给定
#endif
{   (Uint16)(-10000),   10000,              0,              0x2132, 800 ,           },// A8-04 接受数据零偏
{   (Uint16)(-1000),    1000,               100,            0x2102, 801 ,           },// A8-05 接收数据增益
{   0,                  100,                10,             0x0941, 802 ,           },// A8-06 主从通讯心跳时间(仅主机有效)
{   1,                 10000,               1,              0x0943, 803 ,           },// A8-07 主从控制通讯发送周期(仅主机有效)
{   (Uint16)(-10000),   10000,              0,              0x2132, 804 ,           },// A8-08 频率接收数据零偏
{   (Uint16)(-1000),    1000,               100,            0x2102, 805 ,           },// A8-09 频率接收数据增益
{   0,                 10000,              1000,            0x2132, 806 ,           },// A8-10 从机频率正向最大偏差
{   20,                 1000,               50,             0x0142, 807 ,           },// A8-11 (保留)从机频率反向最大偏差

//  A9 下限             A9 上限             A9 出厂       A9 属性 A9-EEPROM地址
{   0,                  65535,              0,              0x0040, 808 ,           },  // 0 727

//  AA 下限             AA 上限             AA 出厂值       AA 属性 AA-EEPROM地址
{   0,                  65535,                  0,          0x0940, 809,            },  // 0,728

//  AB 下限             AB 上限             AB 出厂值       AB 属性 AB-EEPROM地址
{   0,                   1500,           1200,              0x010A, 810 ,           },  // 0  ,729

//  AC 下限             AC 上限             AC 出厂值       AC 属性 AC-EEPROM地址
{  (Uint16)(-10000),    10000,              2000,           0x2163, 811 ,           },// AC-00    ----AC-11, AI1/2/3校正曲线
{  (Uint16)(-10000),    10000,              2000,           0x2163, 812 ,           },// 1,
{  (Uint16)(-10000),    10000,              8000,           0x2163, 813 ,           },// 2,
{  (Uint16)(-10000),    10000,              8000,           0x2163, 814 ,           },// 3
{  (Uint16)(-10000),    10000,              2000,           0x2163, 815 ,           },// 4 AI2
{  (Uint16)(-10000),    10000,              2000,           0x2163, 816 ,           },// 5
{  (Uint16)(-10000),    10000,              8000,           0x2163, 817 ,           },// 6
{  (Uint16)(-10000),    10000,              8000,           0x2163, 818 ,           },// 7
{  (Uint16)(-10000),    10000,              2000,           0x2163, 819 ,           },// 8 AI3
{  (Uint16)(-10000),    10000,              2000,           0x2163, 820 ,           },// 9
{  (Uint16)(-10000),    10000,              8000,           0x2163, 821 ,           },// 10
{  (Uint16)(-10000),    10000,              8000,           0x2163, 822 ,           },// 11
{  (Uint16)(-10000),    10000,              2000,           0x2163, 823 ,           },// AC-12    ----AC-19, AO1/AO2校正曲线
{  (Uint16)(-10000),    10000,              2000,           0x2163, 824 ,           },// 13
{  (Uint16)(-10000),    10000,              8000,           0x2163, 825 ,           },// 14
{  (Uint16)(-10000),    10000,              8000,           0x2163, 826 ,           },// 15
{  (Uint16)(-10000),    10000,              2000,           0x2163, 827 ,           },// 16 AO2
{  (Uint16)(-10000),    10000,              2000,           0x2163, 828 ,           },// 17
{  (Uint16)(-10000),    10000,              8000,           0x2163, 829 ,           },// 18
{  (Uint16)(-10000),    10000,              8000,           0x2163, 830 ,           },// 19
{                 0,    20000,              6000,           0x2163, 831 ,           },// AC-20    ----AC-23, AI2电流校正曲线
{                 0,    20000,              6000,           0x2163, 832 ,           },// 21,
{                 0,    20000,             16000,           0x2163, 833 ,           },// 22,
{                 0,    20000,             16000,           0x2163, 834 ,           },// 23


{                 0,    20000,              6000,           0x2163, 835 ,           },// AC-24    ----AC-27, AO2电流校正曲线
{                 0,    20000,              6000,           0x2163, 836 ,           },// 25
{                 0,    20000,             16000,           0x2163, 837 ,           },// 26
{                 0,    20000,             16000,           0x2163, 838 ,           },// 27

//  AD 下限             AD 上限             AD 出厂值       AD 属性 AD-EEPROM地址
{   0,                  65535,              0,              0x0140, 839 ,           },  // 0,758

//  AE 下限             AE 上限             AE 出厂值       AE 属性 AE-EEPROM地址
{  (Uint16)(-10000),    10000,               2000,           0x2163, 840 ,           },  // 0
{  (Uint16)(-10000),    10000,               2000,           0x2163, 841 ,           },  // 1
{  (Uint16)(-10000),    10000,               8000,           0x2163, 842 ,           },  // 2
{  (Uint16)(-10000),    10000,               8000,           0x2163, 843 ,           },  // 3
{  (Uint16)(-10000),    10000,               2000,           0x2163, 844 ,           },  // 4 AI2
{  (Uint16)(-10000),    10000,               2000,           0x2163, 845 ,           },  // 5
{  (Uint16)(-10000),    10000,               8000,           0x2163, 846 ,           },  // 6
{  (Uint16)(-10000),    10000,               8000,           0x2163, 847 ,           },  // 7
{  (Uint16)(-10000),    10000,               2000,           0x2163, 848 ,           },  // 8 AI3
{  (Uint16)(-10000),    10000,               2000,           0x2163, 849 ,           },  // 9
{  (Uint16)(-10000),    10000,               8000,           0x2163, 850 ,           },  // 10
{  (Uint16)(-10000),    10000,               8000,           0x2163, 851 ,           },  // 11
{  (Uint16)(-10000),    10000,               2000,           0x2163, 852 ,           },  // 12 AO1
{  (Uint16)(-10000),    10000,               2000,           0x2163, 853 ,           },  // 13
{  (Uint16)(-10000),    10000,               8000,           0x2163, 854 ,           },  // 14
{  (Uint16)(-10000),    10000,               8000,           0x2163, 855 ,           },  // 15
{  (Uint16)(-10000),    10000,               2000,           0x2163, 856 ,           },  // 16 AO2
{  (Uint16)(-10000),    10000,               2000,           0x2163, 857 ,           },  // 17
{  (Uint16)(-10000),    10000,               8000,           0x2163, 858 ,           },  // 18
{  (Uint16)(-10000),    10000,               8000,           0x2163, 859 ,           },  // 19
{                 0,    20000,              6000,            0x2163, 860 ,           },  // 20 AI2
{                 0,    20000,              6000,            0x2163, 861 ,           },  // 21
{                 0,    20000,             16000,            0x2163, 862 ,           },  // 22 781
{                 0,    20000,             16000,            0x2163, 863 ,           },  // 23


{                 0,    20000,              6000,           0x2163, 864 ,           },  // 24 AO2
{                 0,    20000,              6000,           0x2163, 865 ,           },  // 25
{                 0,    20000,             16000,           0x2163, 866 ,           },  // 26
{                 0,    20000,             16000,           0x2163, 867 ,           },  // 27,786

//  AF 下限             AF 上限             AF 出厂值       AF 属性 AF-EEPROM地址
{     0,               65535,              1,              0x0140, 868 ,           },  // AF-00,787

//  B0 下限             B0 上限             B0 出厂值       B0 属性 B0-EEPROM地址
{   0,                  65535,              0,              0x0140, 869 ,           },  //

//  B1 下限             B1 上限             B1 出厂值       B1 属性 B1-EEPROM地址
{   0,                  65535,              0,              0x0140, 870 ,           },  //789

//  B2 下限             B2 上限             B2 出厂值       B2 属性 B2-EEPROM地址
{   0,                  65535,              0,              0x0140, 871 ,           },  //

//  B3 下限             B3 上限             B3 出厂值       B3 属性 B3-EEPROM地址
{   0,                  65535,              0,              0x0140, 872 ,           },  //791

//  B4 下限             B4 上限             B4 出厂值       B4 属性 B4-EEPROM地址
{   0,                  65535,              0,              0x0140, 873 ,           },  //

//  B5 下限             B5 上限             B5 出厂值       B5 属性 B5-EEPROM地址
{   0,                  65535,              0,              0x0140, 874 ,           },  //

//  B6 下限             B6 上限             B6 出厂值       B6 属性 B6-EEPROM地址
{   0,                  65535,              0,              0x0140, 875 ,           },  //

//  B7 下限             B7 上限             B7 出厂值       B7 属性 B7-EEPROM地址
{   0,                  65535,              0,              0x0140, 876 ,           },  //

//  B8 下限             B8 上限             B8 出厂值       B8 属性 B8-EEPROM地址
{   0,                  65535,              0,              0x0140, 877 ,           },  //

//  B9 下限             B9 上限             B9 出厂值       B9 属性 B9-EEPROM地址
{   0,                  65535,              0,              0x0140, 878 ,           },  //

//  BA 下限             BA 上限             BA 出厂值       BA 属性 BA-EEPROM地址
{   0,                  65535,              0,              0x0140, 879 ,           },  //

//  BB 下限             BB 上限             BB 出厂值       BB 属性 BB-EEPROM地址
{   0,                  65535,              0,              0x0140, 880 ,           },  //

//  BC 下限             BC 上限             BC 出厂值       BC 属性 BC-EEPROM地址
{   0,                  65535,              0,              0x0140, 881 ,           },  //800

//  BD 下限             BD 上限             BD 出厂值       BD 属性 BD-EEPROM地址
{   0,                  65535,              0,              0x0140, 882 ,           },  //801

//  BE 下限             BE 上限             BE 出厂值       BE 属性 BE-EEPROM地址
{   0,                  65535,              0,              0x0140, 883 ,           },  //802

//  BF 下限             BF 上限             BF 出厂值       BF 属性 BF-EEPROM地址
{   0,                  65535,              0,              0x0140, 884 ,           },  //
                                                                                                                                               
//  C0 下限             C0 上限             C0 出厂值       C0 属性 C0-EEPROM地址
{   0,                  65535,              0,              0x0140, 885 ,           },  //

//  C1 下限             C1 上限             C1 出厂值       C1 属性 C1-EEPROM地址
{   0,                  65535,              0,              0x0140, 886 ,           },

//  C2 下限             C2 上限             C2 出厂值       C2 属性 C2-EEPROM地址
{   0,                  65535,              0,              0x0140, 887 ,           },

//  C3 下限             C3 上限             C3 出厂值       C3 属性 C3-EEPROM地址
{   0,                  65535,              0,              0x0140, 888 ,           },

//  C4 下限             C4 上限             C4 出厂值       C4 属性 C4-EEPROM地址
{   0,                  65535,              0,              0x0140, 889 ,           },

//  C5 下限             C5 上限             C5 出厂值       C5 属性 C5-EEPROM地址
{   0,                  65535,              0,              0x0140, 890 ,           },  // 5,809

//  C6 下限             C6 上限             C6 出厂值       C6 属性 C6-EEPROM地址
{   0,                  65535,              0,              0x0140, 891 ,           },

//  C7 下限             C7 上限             C7 出厂值       C7 属性 C7-EEPROM地址
{   0,                  65535,              0,              0x0140, 892 ,           },

//  C8 下限             C8 上限             C8 出厂值       C8 属性 C8-EEPROM地址
{   0,                  65535,              0,              0x0140, 893 ,           },

//  C9 下限             C9 上限             C9 出厂值       C9 属性 C9-EEPROM地址
{   0,                  65535,              0,              0x0140, 894 ,           },

//  CA 下限             CA 上限             CA 出厂值       CA 属性 CA-EEPROM地址
{   0,                  65535,              0,              0x0140, 895 ,           },

//  CB 下限             CB 上限             CB 出厂值       CB 属性 CB-EEPROM地址
{   0,                  65535,              0,              0x0140, 896 ,           },

//  CC 下限             CC 上限             CC 出厂值       CC 属性 CC-EEPROM地址
{   0,                  1  ,                0,              0x0140, 897 ,           },  // FE-00   运行中点动使能

//  CD 下限             CD 上限             CD 出厂值       CD 属性 CD-EEPROM地址
{   0,                  65535,              0,              0x0140, 898 ,           },  //

//  CE 下限             CE 上限             CE 出厂值       CE 属性 CE-EEPROM地址
{   0,                  65535,              0,              0x0140, 899 ,           },  // 0,818

//  CF 下限             CF 上限             CF 出厂值       CF 属性 CF-EEPROM地址
{   0,                  1,                  0,              0x0140, 900 ,           },  // 0,819
{   0,                  1,                  0,              0x0140, 901 ,           },  // CF-01
{   0,                  65535,              0,              0x0140, 902 ,           },  // CF-02
{   100,                65535,              0,              0x0140, 903 ,           },  // CF-03
{   0,                  65535,              0,              0x0140, 904 ,           },  // CF-04 ,823
{   0,                  65535,              0,              0x0140, 905 ,           },  // CF-05,824
{   0,                  65535,              0,              0x0140, 906 ,           },  // CF-06
{   0,                  65535,              0,              0x0140, 907 ,           },  // CF-07
{   0,                  100,                0,              0x0103, 908 ,           },  // CF-08
{   0,                  1,                  0,              0x0140, 909 ,           },  // CF-09828
{   0,                  65535,              0,              0x0140, 910 ,           }, // CF-10 ,829
{   1,                  65535,              0,              0x0140, 911 ,           },  // 11,830
{   0,                  65535,              0,              0x0140, 912 ,           },  // 12
{   0,                  65535,              0,              0x0140, 913 ,           },  // 13
{   0,                  65535,              0,              0x0140, 914 ,           },  // 14
{   0,                  65535,              0,              0x0140, 915 ,           },  // 15
{   0,                  65535,              0,              0x0140, 916 ,           },  // 16
{   0,                  65535,              0,              0x0140, 917 ,           },  // 17
{   0,                  65535,              0,              0x0140, 918 ,           },  // 18
{   0,                  65535,              0,              0x0140, 919 ,           },  // 19
{   0,                  65535,              0,              0x0140, 920 ,           },  // 20
{   0,                  65535,              0,              0x0140, 921 ,           },  // 21,840
{   0,                  65535,              0,              0x0140, 922 ,           },  // 22
{   0,                  65535,              0,              0x0140, 923 ,           },  // 23
{   0,                  65535,              0,              0x0140, 924 ,           },  // 24
{   0,                  65535,              0,              0x0140, 925 ,           },  // 25
{   0,                  65535,              0,              0x0140, 926 ,           },  // 26
{   0,                  65535,              0,              0x0140, 927 ,           },  // 27
{   0,                  65535,              0,              0x0140, 928 ,           },  // 28
{   0,                  65535,              0,              0x0140, 929 ,           },  // 29 ,848
};

// <-Industry App modify by libo 2015/01/29 17:54:14
const FUNCCODE_INDUSTRY funcCodeIndustry[FNUM_AIRPRESSOR] =
{
//功能码组 功能码组序号 常用功能码索引                                                      最优值
//空压机
{   2,  49, (GetCodeIndex(funcCode.code.vcparaM1.onlineTuneEnable)),        1,},    //F2-49
{   2,  51, (GetCodeIndex(funcCode.code.vcparaM1.rateFrqPercent)),          50,},   //F2-51
{   9,  1,  (GetCodeIndex(funcCode.code.overloadGain)),                     110,},  //F9-01
{   9,  7,  (GetCodeIndex(funcCode.code.shortCheckMode)),                   11,},   //F9-07
{   9,  13,  (GetCodeIndex(funcCode.code.outPhaseLossProtect)),             11,},   //F9-13
};


// fChk，remember对应的EEPROM index
// 请按照功能码union的顺序排列
const Uint16 fcNoAttri2Eeprom[CHK_NUM + REM_NUM] =                                               
{
// 保留
    0 ,     // rsvd4All
    1 ,     // fChk-EEPROM地址
    2 ,     // 
    3 ,     // AIAO_CHK
    
// remember-EEPROM地址
    16  ,   // 0                                             
    17  ,   // 1                                           
    18  ,   // 2                                           
    19  ,   // 3                                           
    20  ,   // 4  
    21  ,   // 5                                            
    22  ,   // 6                                           
    23  ,   // 7                                           
    24  ,   // 8                                           
    25  ,   // 9  
    26  ,   // 10                                           
    27  ,   // 11                                          
    28  ,   // 12                                          
    29  ,   // 13                                          
    30  ,   // 14                                          
    31  ,   // 15 
    32  ,   // 16 
    33  ,   // 17 
    34  ,   // 18 
    35  ,   // 19 
    36  ,   // 20 
    37  ,   // 21 
    38  ,   // 22 
    39  ,   // 23 
    40  ,   // 24 
    41  ,   // 25
    42  ,   // 26
    43  ,   // 27
    44  ,   // 28
    45  ,   // 29
    46  ,   // 30
    47  ,   // 31
    48  ,   // 32
    49  ,   // 33
    50  ,   // 34
    51  ,   // 35
    52  ,   // 36
    53  ,   // 37
    54  ,   // 38
    55  ,   // 39
    56  ,   // 40
    57  ,   // 41
    58  ,   // 42
    59  ,   // 43
    60  ,   // 44
    61  ,   // 45
    62  ,   // 46
    63  ,   // 47

};  



